Documents/ТабельУчетаРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ТабельУчетаРабочегоВремени</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочееВремя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаТабеля</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтметкаТабеля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОтметкиТабеля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СодержаниеРабот</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроектыТиражные</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланРаботТиражный</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяСтавка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТарифныеСтавки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектовСтруктура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтатусыПроектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СтатусыПроектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бланк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ТабельУчетаРабочегоВремени/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если УП_ПереносДанных.ПроведениеПриПереносе() Тогда
		Возврат;
	КонецЕсли;
	
	
	Для Каждого СтрДок Из РабочееВремя Цикл
		Если УП_КадрыСервер.РазрешеноИсправлениеТабеля( СтрДок.ДатаТабеля ) = 0 Тогда
			Сообщить("Табель содержит даты, на которую исправление закрыто, проведение запрещено!");
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
		Если ЗначениеЗаполнено( СтрДок.Основание ) И
			(ТипЗнч( СтрДок.Основание ) = Тип("ДокументСсылка.ПланРабот") или ТипЗнч( СтрДок.Основание ) = Тип("ДокументСсылка.ПланРаботТиражный"))
			и СтрДок.ОтметкаТабеля.ПланРаботНеРазрешен Тогда
			
			Сообщить("Для " + СтрДок.ОтметкаТабеля + " нельзя указывать план работ!");
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		 //проверка статуса проекта
		
		 //!!! временно, для закрытия табеля за январь 2014
		Если ЗначениеЗаполнено( СтрДок.Основание ) Тогда
			Если ТипЗнч( СтрДок.Основание ) = Тип("ДокументСсылка.ПланРабот") Тогда
				Проект = СтрДок.Основание.ЗадачаПроекта.Владелец;
				Если Проект.Статус <> Перечисления.СтатусыПроектов.ВРаботе Тогда
					Сообщить("Проект " + Проект + ", ("+ СтрДок.Основание +") имеет статус " + Проект.Статус);
					Отказ = Истина;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		
		
	КонецЦикла;

	
КонецПроцедуры

//********************************************************
// отменять проведение можно только администратору с полными правами
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	// разрешаем суперпользователю или фин.директору
	//Если НЕ РольДоступна("ПолныеПрава") Тогда 
	//	Отказ = Истина;
	//	Возврат 
	//КонецЕсли;
		
	Для Каждого СтрДок Из РабочееВремя Цикл
		Если УП_КадрыСервер.РазрешеноИсправлениеТабеля( СтрДок.ДатаТабеля ) = 0 Тогда
			Сообщить("Табель содержит даты, на которую исправление закрыто, отмена проведения запрещена!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;                                                                                                         
	КонецЦикла;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ИсполнительДокумента 	= ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры
